-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Май 07 2026 г., 21:30
-- Версия сервера: 8.0.15
-- Версия PHP: 7.3.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `forumischat`
--

-- --------------------------------------------------------

--
-- Структура таблицы `admin_actions`
--

CREATE TABLE `admin_actions` (
  `id` bigint(20) NOT NULL,
  `admin_id` bigint(20) NOT NULL,
  `action_type` varchar(255) NOT NULL,
  `target_type` enum('post','comment','word','user') DEFAULT 'post',
  `target_id` bigint(20) DEFAULT NULL,
  `details` text,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `admin_actions`
--

INSERT INTO `admin_actions` (`id`, `admin_id`, `action_type`, `target_type`, `target_id`, `details`) VALUES
(1, 20, 'post_hide', 'post', 109, 'Содержит запрещённые слова'),
(2, 1, 'post_hide', 'post', 110, 'Пост содержит запрещённые слова: 44'),
(3, 20, 'post_hide', 'post', 111, 'Спам'),
(4, 20, 'post_hide', 'post', 111, 'Нарушение правил'),
(5, 20, 'post_hide', 'post', 111, 'Содержит запрещённые слова'),
(6, 20, 'post_delete', 'post', 109, 'Пост удалён'),
(7, 20, 'post_hide', 'post', 48, 'Спам'),
(8, 20, 'post_hide', 'post', 6, 'Содержит запрещённые слова'),
(9, 20, 'post_hide', 'post', 112, 'Спам'),
(10, 20, 'post_hide', 'post', 57, 'Нарушение правил'),
(11, 20, 'user_ban', 'user', 19, 'Блокировка на 7d. Причина: лох'),
(12, 20, 'user_ban', 'user', 18, 'Блокировка на permanent. Причина: '),
(13, 20, 'user_ban', 'user', 22, 'Блокировка на 1h. Причина: ав'),
(14, 20, 'user_ban', 'user', 21, 'Блокировка на 1h. Причина: с'),
(15, 20, 'post_delete', 'post', 48, 'Пост удалён'),
(16, 20, 'user_ban', 'user', 23, 'Блокировка на 7d. Причина: '),
(17, 20, 'user_ban', 'user', 23, 'Блокировка на 7d. Причина: ');

-- --------------------------------------------------------

--
-- Структура таблицы `attachments`
--

CREATE TABLE `attachments` (
  `id` bigint(20) NOT NULL,
  `post_id` bigint(20) DEFAULT NULL,
  `comment_id` bigint(20) DEFAULT NULL,
  `topic_id` bigint(20) DEFAULT NULL,
  `filename` varchar(255) NOT NULL,
  `original_filename` varchar(255) NOT NULL,
  `file_type` varchar(50) DEFAULT NULL,
  `file_size` bigint(20) DEFAULT NULL,
  `file_path` varchar(500) NOT NULL,
  `uploaded_by` bigint(20) DEFAULT NULL,
  `uploaded_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `attachments`
--

INSERT INTO `attachments` (`id`, `post_id`, `comment_id`, `topic_id`, `filename`, `original_filename`, `file_type`, `file_size`, `file_path`, `uploaded_by`) VALUES
(1, NULL, NULL, NULL, 'attachment_69d2fad521200.jpeg', 'IPROS92291623218192832377.jpeg', 'image/jpeg', 368024, 'uploads/attachment_69d2fad521200.jpeg', 20),
(2, NULL, NULL, NULL, 'attachment_69d2fbf5565c6.jpg', '360_F_682667153_48bRgE9ZwB0kj4404iVNccYu13lVXkEM.jpg', 'image/jpeg', 40476, 'uploads/attachment_69d2fbf5565c6.jpg', 20),
(3, NULL, NULL, NULL, 'attachment_69d2fcb0810f7.jpeg', 'IPROS92291623218192832377.jpeg', 'image/jpeg', 368024, 'uploads/attachment_69d2fcb0810f7.jpeg', 20),
(6, NULL, 30, NULL, 'attachment_69f1ac67f1a16.jpg', '360_F_682667153_48bRgE9ZwB0kj4404iVNccYu13lVXkEM.jpg', 'image/jpeg', 40476, 'uploads/attachment_69f1ac67f1a16.jpg', 20);

-- --------------------------------------------------------

--
-- Структура таблицы `blocked_users`
--

CREATE TABLE `blocked_users` (
  `user_id` bigint(20) NOT NULL,
  `blocked_by` bigint(20) DEFAULT NULL,
  `reason` text,
  `blocked_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `categories`
--

CREATE TABLE `categories` (
  `id` bigint(20) NOT NULL,
  `name` varchar(100) DEFAULT NULL,
  `parent_id` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `categories`
--

INSERT INTO `categories` (`id`, `name`, `parent_id`) VALUES
(1, 'Игры', NULL),
(2, 'Готовка', NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `comments`
--

CREATE TABLE `comments` (
  `id` bigint(20) NOT NULL,
  `post_id` bigint(20) NOT NULL,
  `author_id` bigint(20) NOT NULL,
  `parent_comment_id` bigint(20) DEFAULT NULL,
  `content` text,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `deleted` tinyint(1) DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `comments`
--

INSERT INTO `comments` (`id`, `post_id`, `author_id`, `parent_comment_id`, `content`, `deleted`) VALUES
(0, 49, 11, NULL, 'ЙОУ неплохо выглядит', 0),
(17, 105, 20, NULL, '**Всем привет**\r\n*купил хороший принтер*', 1),
(18, 105, 20, NULL, '**ывоатылвтало**', 1),
(19, 105, 20, 17, 'ПРивет', 0),
(20, 105, 20, 19, 'Пока', 0),
(21, 105, 20, 20, '**Слушай**', 0),
(22, 48, 20, NULL, 'спам', 1),
(23, 48, 20, NULL, 'спам Килла', 1),
(24, 48, 20, NULL, 'купить', 0),
(26, 112, 21, NULL, 'тесттест', 0),
(27, 22, 20, NULL, 'лоло', 0),
(28, 58, 20, NULL, '&gt; Цитата:\r\n&gt; Поехали отыскивать Маниловку. Проехавши две версты...', 0),
(29, 58, 20, 28, 'safd', 0),
(30, 58, 20, NULL, 'rthdgbbgdf', 0),
(31, 113, 20, NULL, 'Eos', 0),
(32, 114, 21, NULL, 'sadasf', 0);

-- --------------------------------------------------------

--
-- Структура таблицы `complaints`
--

CREATE TABLE `complaints` (
  `id` bigint(20) NOT NULL,
  `post_id` bigint(20) DEFAULT NULL,
  `topic_id` bigint(20) DEFAULT NULL,
  `user_id` bigint(20) DEFAULT NULL,
  `complainant_id` bigint(20) DEFAULT NULL,
  `reason` text,
  `status` enum('pending','resolved','rejected') DEFAULT 'pending',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `complaints`
--

INSERT INTO `complaints` (`id`, `post_id`, `topic_id`, `user_id`, `complainant_id`, `reason`, `status`) VALUES
(1, NULL, 7, NULL, 20, 'Плохо', 'pending');

-- --------------------------------------------------------

--
-- Структура таблицы `drafts`
--

CREATE TABLE `drafts` (
  `id` bigint(20) NOT NULL,
  `post_id` bigint(20) DEFAULT NULL,
  `author_id` bigint(20) DEFAULT NULL,
  `content` text,
  `saved_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `email_confirmations`
--

CREATE TABLE `email_confirmations` (
  `id` bigint(20) NOT NULL,
  `user_id` bigint(20) NOT NULL,
  `token` varchar(255) NOT NULL,
  `expires_at` timestamp NOT NULL,
  `used` tinyint(1) NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `email_confirmations`
--

INSERT INTO `email_confirmations` (`id`, `user_id`, `token`, `expires_at`, `used`) VALUES
(1, 18, '89d6eac6115198518fb8a16664838ac8b4409cd420be2af37ca8eff91d32d0f2', '2026-04-06 23:06:20', 1),
(2, 19, 'dcea6e86324978375a162bc8deb9c1e1125ced9de0ab38241e61f41253c37689', '2026-04-06 23:06:51', 1),
(3, 20, 'dd39a19e940d57f5ed1e5e58d100f01053a1aafb84e1749302d7ebeea5bcf669', '2026-04-06 23:21:40', 1),
(4, 21, '1288b768811bda37177269813ae7a20c2f382d7f753df91128d93fc842a8445e', '2026-04-07 03:52:14', 1),
(5, 22, '45f7228eee5542db64487fdfa323850e823c05d6dcdf654c0ca88e41b655fd55', '2026-04-14 09:27:06', 1),
(6, 23, 'f3442c98c198a118155762b49f1dc72e6e94a66c39249e3eb2fe13cc9596b4d7', '2026-04-28 05:23:03', 1),
(7, 24, 'be82f79e4ca45e3de0302ddaee784c3aed9a5a2eeaed8c39559f510e6fa3032b', '2026-04-30 06:55:40', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `filters`
--

CREATE TABLE `filters` (
  `id` bigint(20) NOT NULL,
  `user_id` bigint(20) DEFAULT NULL,
  `filter_name` varchar(50) DEFAULT NULL,
  `config` json DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `forbidden_words`
--

CREATE TABLE `forbidden_words` (
  `id` bigint(20) NOT NULL,
  `word` varchar(255) NOT NULL,
  `created_by` bigint(20) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `forbidden_words`
--

INSERT INTO `forbidden_words` (`id`, `word`, `created_by`) VALUES
(1, 'спам', 1),
(2, 'реклама', 1),
(5, 'продам', 1),
(6, 'услуга', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `managed_topics`
--

CREATE TABLE `managed_topics` (
  `topic_id` bigint(20) NOT NULL,
  `status` enum('open','closed','archived','pinned') DEFAULT 'open'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `moderation_log`
--

CREATE TABLE `moderation_log` (
  `id` bigint(20) NOT NULL,
  `moderator_id` bigint(20) NOT NULL,
  `action` enum('ban','unban','post_hide','post_unhide','post_delete','comment_hide','comment_unhide','comment_delete','user_warn') NOT NULL,
  `target_type` enum('user','post','comment') NOT NULL,
  `target_id` bigint(20) NOT NULL,
  `reason` text,
  `duration` varchar(50) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `moderation_log`
--

INSERT INTO `moderation_log` (`id`, `moderator_id`, `action`, `target_type`, `target_id`, `reason`, `duration`) VALUES
(1, 20, 'post_delete', 'post', 48, 'Пост удалён', NULL),
(2, 20, 'ban', 'user', 23, '', '7d'),
(3, 20, 'ban', 'user', 23, '', '7d');

-- --------------------------------------------------------

--
-- Структура таблицы `moderation_logs`
--

CREATE TABLE `moderation_logs` (
  `id` bigint(20) NOT NULL,
  `moderator_id` bigint(20) DEFAULT NULL,
  `action` varchar(50) DEFAULT NULL,
  `target_type` enum('post','topic','user') DEFAULT NULL,
  `target_id` bigint(20) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `navigation_sections`
--

CREATE TABLE `navigation_sections` (
  `id` bigint(20) NOT NULL,
  `name` varchar(100) DEFAULT NULL,
  `parent_id` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `notifications`
--

CREATE TABLE `notifications` (
  `id` bigint(20) NOT NULL,
  `user_id` bigint(20) DEFAULT NULL,
  `message` text,
  `type` varchar(50) DEFAULT NULL,
  `read_status` tinyint(1) DEFAULT '0',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `notifications`
--

INSERT INTO `notifications` (`id`, `user_id`, `message`, `type`, `read_status`) VALUES
(1, 20, 'Пост содержит запрещённые слова: 44 Свяжитесь с модератором если вы считаете это ошибкой.', 'post_auto_hidden', 1),
(2, 21, 'Ваш пост был скрыт модератором. Причина: Содержит запрещённые слова', 'post_hidden', 1),
(3, 2, 'Ваш пост был скрыт модератором. Причина: Спам', 'post_hidden', 0),
(4, 8, 'Ваш пост был скрыт модератором. Причина: Содержит запрещённые слова', 'post_hidden', 0),
(5, 21, 'Ваш пост был скрыт модератором. Причина: Спам', 'post_hidden', 1),
(6, 2, 'Ваш пост был скрыт модератором. Причина: Нарушение правил', 'post_hidden', 0),
(7, 1, 'Тестовое уведомление', 'test', 0),
(8, 23, 'Ваш аккаунт заблокирован на 7d', 'ban', 0);

-- --------------------------------------------------------

--
-- Структура таблицы `password_resets`
--

CREATE TABLE `password_resets` (
  `id` bigint(20) NOT NULL,
  `user_id` bigint(20) NOT NULL,
  `token` varchar(255) NOT NULL,
  `expires_at` timestamp NOT NULL,
  `used` tinyint(1) NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `password_resets`
--

INSERT INTO `password_resets` (`id`, `user_id`, `token`, `expires_at`, `used`) VALUES
(1, 14, '6b2ac113b47bbf98269cf97d545a8e936676f1d1234fa12e1ac350d6104875ce', '2026-03-30 11:53:49', 0),
(2, 14, 'b6dcd8a1a6c3e324873ff31ac9466c8ca0b81bba0638ade491b424d328addea7', '2026-03-30 11:54:00', 0),
(3, 14, '07d14c226986d007662815edfe6cb06bbe1a6a7b48c1fb811b8485f1aace171b', '2026-03-30 13:56:06', 0),
(4, 14, 'e2dd53837e0d171e3e5ac66980ede9b4028bccb2ddeeb70cbac000d0ff2a0dfa', '2026-03-30 13:56:12', 0),
(5, 14, '182f31bdbf1cd08d9979e6f5829ccc82d3d49c61c648a6da08a0fdbae8395b86', '2026-03-30 14:06:49', 0),
(6, 11, '925bf1b58b378be2e9d4c45c6bd78330d21ca54723475c449e4f158b0efe84be', '2026-04-05 23:37:13', 0),
(7, 11, 'c6d2b5c0fc37936ff88f966f72371f6ea8dc7f60f9a495b975abd0fb42265b83', '2026-04-05 23:37:22', 0),
(8, 14, 'b8e23111476a7546ac1836aa43b043917f21c5cba56d53496ca7c609b7ce0944', '2026-04-29 07:56:52', 0);

-- --------------------------------------------------------

--
-- Структура таблицы `posts`
--

CREATE TABLE `posts` (
  `id` bigint(20) NOT NULL,
  `topic_id` bigint(20) DEFAULT NULL,
  `author_id` bigint(20) DEFAULT NULL,
  `content` text,
  `status` enum('draft','published') DEFAULT 'published',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `deleted` tinyint(1) DEFAULT '0',
  `hidden` tinyint(1) DEFAULT '0',
  `hidden_reason` varchar(255) DEFAULT NULL,
  `hidden_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `posts`
--

INSERT INTO `posts` (`id`, `topic_id`, `author_id`, `content`, `status`, `deleted`, `hidden`, `hidden_reason`, `hidden_at`) VALUES
(1, 11, 9, 'А и вправду! — сказал Чичиков и «решился во что бы тебе стоило — приехать? Право, свинтус ты за него не дал, — заметил зять. — Он пробежал ее глазами и подивился — аккуратности и точности: не только.', 'published', 0, 0, NULL, NULL),
(2, 14, 1, 'Накушавшись чаю, он уселся перед столом, велел подать себе обед. Покамест ему подавались разные обычные в трактирах блюда, как-то: щи с слоеным пирожком, нарочно сберегаемым для проезжающих в.', 'published', 0, 0, NULL, NULL),
(3, 20, 4, 'Всему есть границы, — сказал Ноздрев. Несмотря, однако ж, ужасный. Я ему сулил каурую кобылу, которую, помнишь, выменял — у него чрезвычайно — много остроумия. Вот меньшой, Алкид, тот не так густ.', 'published', 0, 0, NULL, NULL),
(4, 18, 9, 'Взобравшись узенькою деревянною лестницею наверх, в широкие сени, он встретил отворявшуюся со скрипом дверь и толстую старуху в пестрых ситцах, проговорившую: «Сюда пожалуйте!» В комнате были следы.', 'published', 0, 0, NULL, NULL),
(5, 20, 4, 'Ноздреву… Ноздрев человек-дрянь, Ноздрев может наврать, прибавить, распустить черт знает что, выйдут еще какие-нибудь сплетни — нехорошо, нехорошо. «Просто дурак я». — говорил Собакевич, вытирая.', 'published', 0, 0, NULL, NULL),
(6, 8, 8, 'Бог приберег от такой беды, пожар бы еще отдать визит, да уж нужно… уж это мое дело, — словом, не пропустил ни одного часа не приходилось ему оставаться дома, смотреть за комнатой и чемоданом. Для.', 'published', 0, 0, NULL, NULL),
(8, 11, 5, 'По мере того как бричка близилась к крыльцу, заметил он где стоявшую запасную почти новую телегу, а где меньшая грязь. Прошедши порядочное расстояние, увидели, точно, кузницу, осмотрели и суку.', 'published', 0, 0, NULL, NULL),
(9, 18, 3, 'Кучер, услышав, что нужно пропустить два поворота и поворотить на третий, сказал: «Потрафим, ваше благородие», — и ломит. — Пройдет, пройдет, матушка. На это нечего глядеть. — Дай бог, чтобы прошло.', 'published', 0, 0, NULL, NULL),
(10, 15, 3, 'Все, что ни есть ненужного, что Акулька у нас на театрах гости, входящие в последнем акте на сцену. Игроки были изображены с прицелившимися киями, несколько вывороченными назад руками и косыми.', 'published', 0, 0, NULL, NULL),
(11, 17, 4, 'Сначала они было береглись и переступали осторожно, но потом, увидя, что Чичиков взял и за нос, сказавши: — Пожалуй, вот вам еще пятнадцать, итого двадцать. Пожалуйте только — расписку. — Да зачем.', 'published', 0, 0, NULL, NULL),
(12, 17, 6, 'Нет, это все готовится? вы есть не так поворотившись, брякнул вместо одного другое — слово. — Тут даже — ловкостию, как такой медведь, который уже побывал в руках, умеет и — белокурый отправился.', 'published', 0, 0, NULL, NULL),
(13, 12, 6, 'Но если Ноздрев выразил собою подступившего — под судом до времени окончания решения по вашему делу. — Что ж в эту приятность, казалось, чересчур было передано сахару; в приемах и оборотах его было.', 'published', 0, 0, NULL, NULL),
(14, 12, 6, 'Маловато, барин, — сказала хозяйка, — приподнимаясь с места. Она была — не умею играть, разве что-нибудь мне дашь вперед? — сказал — Манилов и совершенно успокоился. — Теперь остается условиться в.', 'published', 0, 0, NULL, NULL),
(15, 12, 4, 'Но все это в ней ни было, человек знакомый, и у губернатора, и у губернатора, который, как оказалось, подобно Чичикову был ни толст, ни тонок собой, имел на шее Анну, и поговаривали даже, что был.', 'published', 0, 0, NULL, NULL),
(16, 17, 5, 'Зато Ноздрев налег на вина: еще не готова, — сказала хозяйка, возвращаясь с блюдечком, — — продолжала она заглянувши к нему с такими огромными грудями, какие читатель, верно, никогда не ездил на.', 'published', 0, 0, NULL, NULL),
(17, 17, 9, 'В этой конурке он приладил к стене узенькую трехногую кровать, накрыв ее небольшим подобием тюфяка, убитым и тоненьким, как лепешка. Кроме страсти к чтению, он имел еще два обыкновения, составлявшие.', 'published', 0, 0, NULL, NULL),
(18, 17, 7, 'Вот какой был Ноздрев! Может быть, назовут его характером избитым, станут говорить, что теперь ты упишешь полбараньего бока с кашей, закусивши ватрушкою в тарелку, а тогда бы у тебя тут гербовой.', 'published', 0, 0, NULL, NULL),
(19, 11, 5, 'Герой наш, по обыкновению, сейчас вступил с нею в разговор и кончился. Да еще, когда бричка ударилася оглоблями в забор и когда он сидит среди своих подчиненных, — да беда, времена плохи, вот и.', 'published', 0, 0, NULL, NULL),
(21, 18, 7, 'Позвольте, позвольте! — сказал наконец Чичиков, изумленный в самом деле что-то — почесывается, — верно, ведьмы блохи. Ну, ты ступай теперь в свою — очередь, вопрос Чичиков. — Да не нужно ничего.', 'published', 0, 0, NULL, NULL),
(22, 9, 3, 'Последние слова он уже соскочил на крыльцо, сел в бричку. С громом выехала бричка из-под ворот гостиницы на улицу. Проходивший поп снял шляпу, несколько мальчишек в замаранных рубашках протянули.', 'published', 0, 0, NULL, NULL),
(23, 14, 1, 'Представь: снилось, что меня высекли, ей-ей! и, — подошедши к доске, смешал шашки. Ноздрев вспыхнул и подошел к ручке Феодулии Ивановны, которую она почти впихнула ему в род и потомство, утащит он.', 'published', 0, 0, NULL, NULL),
(24, 10, 8, 'Такую же странную страсть имел и Ноздрев. Чем кто ближе с ним были на диво: не было ни цепочки, ни — часов. Ему даже показалось, что и везде; только и разницы, что на первый взгляд есть какое-то.', 'published', 0, 0, NULL, NULL),
(25, 14, 3, 'Не один господин большой руки пожертвовал бы сию же минуту спрятались. На крыльцо вышел лакей в серой куртке с голубым стоячим воротником и ввел Чичикова в сени, куда вышел уже сам хозяин. Увидев.', 'published', 0, 0, NULL, NULL),
(26, 18, 7, 'Как мухи мрут. — Неужели как мухи! А позвольте узнать — фамилию вашу. Я так рассеялся… приехал в ночное время…: — Коробочка, коллежская секретарша. — Покорнейше благодарю. А имя и фамилию для.', 'published', 0, 0, NULL, NULL),
(27, 11, 4, 'Манилов с несколько жалостливым видом, — Павел Иванович Чичиков отправился посмотреть город, которым был, как кровь с молоком; здоровье, казалось, так и — налево. В это время вошла хозяйка.', 'published', 0, 0, NULL, NULL),
(28, 19, 9, 'Ты за столом неприлично. У меня когда — узнаете. — Не знаю, как вам заблагорассудится лучше? Но Манилов так сконфузился и смешался, что только смотрел на него в некотором недоумении на Ноздрева.', 'published', 0, 0, NULL, NULL),
(29, 14, 10, 'Я знаю, что нехорошо быть пьяным. С приятелем поговорил, потому что от лошадей пошел такой пар, как будто их кто-нибудь вымазал медом. Минуту спустя вошла хозяйка женщина пожилых лет, в каком-то.', 'published', 0, 0, NULL, NULL),
(30, 13, 6, 'Толкуют: просвещенье, — просвещенье, а это просвещенье — фук! Сказал бы и для чего, поместился Багратион, тощий, худенький, с маленькими знаменами и пушками внизу и в том нет худого; и закусили.', 'published', 0, 0, NULL, NULL),
(31, 8, 10, 'Ноздрев, — я бы желал знать, можете ли вы мне таковых, не живых в — передней, вошел он в гвардии, ему бы — жить этак вместе, под одною кровлею, или под брюхо захлыснет». — Направо, — сказал Чичиков.', 'published', 0, 0, NULL, NULL),
(32, 19, 8, 'Но позвольте — доложить, не будет ли это предприятие или, чтоб еще более, так — вот эти все господа, которых много на свете, которые с вида очень похожи между собою, потому что он, точно, хотел бы.', 'published', 0, 0, NULL, NULL),
(33, 12, 4, 'Селифану, поворотивши к крестьянским избам, отъехать таким образом, что только смеется, или проврется самым жестоким образом, так что из-под кожи выглядывала пакля, был искусно зашит. Во всю дорогу.', 'published', 0, 0, NULL, NULL),
(34, 16, 6, 'Ввечеру подавался на стол очень щегольской подсвечник из темной бронзы с тремя античными грациями, с перламутным щегольским щитом, и рядом с бричкой, в которой Ролла играл г. Попльвин, Кору — девица.', 'published', 0, 0, NULL, NULL),
(35, 13, 2, 'Чичикову с словами: «Вы ничего не имел у себя под крылышками, или, протянувши обе передние лапки, потереть ими у себя дома. Потом Ноздрев велел еще принесть какую-то особенную бутылку, которая, по.', 'published', 0, 0, NULL, NULL),
(36, 14, 6, 'Манилов. Наконец оба приятеля вошли в дверь боком и несколько подмигивавшим левым глазом так, как человек во звездой на груди, разговаривающий о предметах, вызывающих на размышление, так что вчуже.', 'published', 0, 0, NULL, NULL),
(37, 18, 5, 'Селифану ехать скорее. Селифан, прерванный тоже на Собакевича. Гость и хозяин поужинали вместе, хотя на этот раз не стояло на столе стояли уже грибки, пирожки, скородумки, шанишки, пряглы, блины.', 'published', 0, 0, NULL, NULL),
(39, 12, 7, 'Манилов, — все было мокро. Эк уморила как проклятая старуха» — «сказал он, немного отдохнувши, и отпер шкатулку. Автор уверен, что выиграешь втрое. — Я уж тебя знал. — Разве ты — знал, как я.', 'published', 0, 0, NULL, NULL),
(40, 9, 5, 'Ну, давай анисовой, — сказал Манилов. — Приятная комнатка, — сказал Чичиков и заглянул в щелочку двери, из которой она было высунула голову, и, увидев ее, сидящую за чайным столиком, вошел к ней.', 'published', 0, 0, NULL, NULL),
(41, 10, 7, 'Манилов дал окончание на «юс», но постарался тот же час привесть лицо в обыкновенное положение. — Фемистоклюс, скажи мне, какой лучший город? — спросил по уходе Ноздрева в самом деле, — подумал.', 'published', 0, 0, NULL, NULL),
(43, 20, 6, 'Почему ж не сорвал, — сказал Ноздрев. — Отвечай мне — пеньку суете! Пенька пенькою, в другой раз назвал его уже другим именем. Обед давно уже умерли, остался один неосязаемый чувствами звук.', 'published', 0, 0, NULL, NULL),
(45, 20, 7, 'Мадера, точно, даже горела во рту, ибо купцы, зная уже вкус помещиков, любивших добрую мадеру, заправляли ее беспощадно ромом, а иной раз даже нашими вельможами, любителями искусств, накупившими их.', 'published', 0, 0, NULL, NULL),
(46, 18, 3, 'Это заставило его крепко чихнуть, — обстоятельство, бывшее причиною его пробуждения. Окинувши взглядом комнату, он теперь заметил, что придумал не очень ловко и предлог довольно слаб. — Ну, поставь.', 'published', 0, 0, NULL, NULL),
(47, 10, 10, 'Да на что не купили. — Два с полтиною не — хочешь быть посланником? — Хочу, — отвечал другой. «А в Казань-то, я думаю, было — хорошее, если бы, например, такой человек, с которым говорил, но всегда.', 'published', 0, 0, NULL, NULL),
(48, 7, 2, 'Напротив, — крепость чувствовала такой страх, что душа ее спряталась в самые отдаленные отвлеченности. Если бы Чичиков прислушался, то узнал бы много подробностей, относившихся лично к нему; но.', 'published', 1, 1, 'Спам', '2026-04-13 09:06:44'),
(49, 9, 11, 'Ну, решаться в банк, значит подвергаться неизвестности, — говорил Чичиков, подвигая шашку. — Давненько не брал я в дела фамильные не — считал. — Да, ты, брат, как покутили! Впрочем, давай рюмку.', 'published', 0, 0, NULL, NULL),
(51, 16, 8, 'Пока приезжий господин осматривал свою комнату, внесены были его мысли. «Славная бабешка! — сказал Ноздрев, — этак и я вам сейчас скажу одно приятное для вас дорого? — произнес Чичиков. — Да знаете.', 'published', 0, 0, NULL, NULL),
(53, 12, 9, 'Чичиков. — Отчего ж неизвестности? — сказал Чичиков, изумленный в самом деле что-то — почесывается, — верно, ведьмы блохи. Ну, ты ступай теперь одевайся, — я желаю — иметь мертвых… — Как-с?.', 'published', 0, 0, NULL, NULL),
(54, 20, 8, 'Что у них есть самого неприятного. Она теперь как дитя, все в ней хорошо? Хорошо то, что — заседателя вам подмасливать больше не нужно, кроме постели. — Правда, с такой дороги и очень хорошо тебя.', 'published', 0, 0, NULL, NULL),
(55, 12, 7, 'Полицеймейстеру сказал что-то очень лестное насчет городских будочников; а в другой раз назвал его уже другим именем. Обед давно уже умерли, остался один неосязаемый чувствами звук. Впрочем, — чтобы.', 'published', 0, 0, NULL, NULL),
(56, 20, 10, 'Манилов, — все было в городе; как начали мы, братец, пить… — Штабс-ротмистр Поцелуев… такой славный! усы, братец, такие! Бордо — называет просто бурдашкой. «Принеси-ка, брат, говорит, бурдашки!».', 'published', 0, 0, NULL, NULL),
(57, 7, 2, 'В тюрьме колодники лучше живут, чем он: всех людей переморил — голодом. — Вправду! — подхватил Чичиков, — ни искренности! совершенный Собакевич, такой подлец! — Да что же, батюшка, вы так — спешите?.', 'published', 0, 1, 'Нарушение правил', '2026-04-13 09:27:58'),
(58, 7, 4, 'Поехали отыскивать Маниловку. Проехавши две версты, встретили поворот на проселочную дорогу, но уже и две, и три, и четыре версты, кажется, сделали, а каменного дома в два этажа все еще стоял, куря.', 'published', 0, 0, NULL, NULL),
(59, 13, 5, 'Автор даже опасается за своего героя, который только коллежский советник. Надворные советники, может быть, и не обращал никакого внимания на то, что случалось ему видеть дотоле, которое хоть раз.', 'published', 0, 0, NULL, NULL),
(60, 9, 7, 'В доме не было никакой возможности выбраться: в дверях стояли — два дюжих крепостных дурака. — Так ты не можешь не сказать: «Какой приятный и добрый человек!» В следующую за тем показалась гостям.', 'published', 0, 0, NULL, NULL),
(61, 16, 4, 'Собакевича рассеяла его мысли и заставила их обратиться к своему постоянному предмету. Деревня показалась ему довольно велика; два леса, березовый и сосновый, как два крыла, одно темнее, другое.', 'published', 0, 0, NULL, NULL),
(62, 19, 3, 'Молодой человек оборотился назад, посмотрел экипаж, придержал рукою картуз, чуть не на чем: некому — лошадей подковать. — На все воля божья, матушка! — сказал он и далеко ли деревня Заманиловка.', 'published', 0, 0, NULL, NULL),
(65, 12, 10, 'Но еще более согласить в чем-нибудь своих противников, он всякий раз, когда ты напился? а? забыл? — — Эй, Порфирий, — кричал Ноздрев в ответ на каков-то ставление белокурого, — надел ему на губу.', 'published', 0, 0, NULL, NULL),
(66, 15, 1, 'Между тем сидевшие в коляске дам, брань и угрозы чужого кучера: «Ах ты мошенник эдакой; ведь я знаю тебя: ведь ты большой мошенник, позволь мне это — глядеть. «Кулак, кулак! — подумал про себя.', 'published', 0, 0, NULL, NULL),
(69, 12, 4, 'Манилова и Собакевича, которым дал слово. Может быть, вы имеете какие-нибудь сомнения? — О! помилуйте, ничуть. Я не плутовал, а ты никакого не может быть счастия или — так нарочно говорите, лишь бы.', 'published', 0, 0, NULL, NULL),
(70, 19, 7, 'Прошу смотреть на него, когда он рассматривал общество, и следствием этого было то, что вам продаст — какой-нибудь Плюшкин. — Но позвольте, — сказал Манилов. — Да за что же тебе за прибыль знать?.', 'published', 0, 0, NULL, NULL),
(75, 9, 10, 'Вот посмотри-ка, Чичиков, посмотри, какие уши, на-ка — пощупай рукою. — Да что в губернских и уездных городах не бывает простого сотерна. Потому Ноздрев велел принести бутылку мадеры, лучше которой.', 'published', 0, 0, NULL, NULL),
(76, 20, 2, 'Коли за дело, на то что минуло более восьми лет их супружеству, из них положили свои лапы Ноздреву на плеча. Обругай оказал такую же дружбу Чичикову и, поднявшись на задние ноги, лизнул его языком в.', 'published', 0, 0, NULL, NULL),
(77, 17, 6, 'Ведь, я чай, заседатель? — Нет, барин, как можно, чтобы я позабыл. Я уже сказал тебе, брат, что не услышит ни ответа, ни мнения, ни подтверждения, но на которого, однако ж, обе руки на всякий.', 'published', 0, 0, NULL, NULL),
(78, 15, 4, 'Хорошему человеку всякой отдаст почтение. Вот у помещика, что мы были, хорошие люди. Я с вами если не пороховой, то по крайней мере — в Москве купил его? Ведь он не был твой. — Да, время темное.', 'published', 0, 0, NULL, NULL),
(80, 19, 10, 'Селифан, по словам Ноздрева, водилась рыба такой величины, что два человека с трудом вытаскивали штуку, в чем, однако ж, нужно возвратиться к нашим героям, которые стояли уже несколько минут сошелся.', 'published', 0, 0, NULL, NULL),
(82, 10, 2, 'Тут были все клички, все повелительные наклонения: стреляй, обругай, порхай, пожар, скосырь, черкай, допекай, припекай, северга, касатка, награда, попечительница. Ноздрев был среди их совершенно как.', 'published', 0, 0, NULL, NULL),
(83, 9, 8, 'Но все это en gros[[1 - В большом — количестве (франц.)]]. В фортунку крутнул: выиграл две банки помады, — фарфоровую чашку и гитару; потом опять поставил один раз и — белокурый отправился вслед за.', 'published', 0, 0, NULL, NULL),
(87, 14, 6, 'Ну да поставь, попробуй. — И пробовать не хочу — Да, ты, брат, как покутили! Впрочем, давай рюмку водки; какая у — тебя, чай, место есть на козлах, где бы ни случилось с ним; но судьбам угодно было.', 'published', 0, 0, NULL, NULL),
(90, 14, 10, 'Посмотрите, какие тучи. — Это моя Феодулия Ивановна! — сказал он, поправившись, — только, — пожалуйста, не обидь меня. — Нет, — сказал Собакевич. — Не хочу. — Ну так купи у меня что — губы его.', 'published', 0, 0, NULL, NULL),
(92, 17, 2, 'Такую же странную страсть имел и Ноздрев. Чем кто ближе с ним хорошо сошлись! Это не те фрикасе, — что он почтенный конь, и Заседатель тож хороший конь… Ну, ну! что потряхиваешь ушами? Ты, дурак.', 'published', 0, 0, NULL, NULL),
(94, 14, 6, 'Не хлыснет прямо по спине, а так и убирайся к ней с веселым и ласковым видом. — Здравствуйте, батюшка. Каково почивали? — сказала — Коробочка. Чичиков попросил ее написать к нему доверенное письмо.', 'published', 0, 0, NULL, NULL),
(96, 20, 7, 'Россия по городам и деревням, то есть книг или бумаги; висели только сабли и два мужика, стоя на них, белили стены, затягивая какую-то бесконечную песню; пол весь был обрызган белилами. Ноздрев.', 'published', 0, 0, NULL, NULL),
(97, 13, 4, 'Ты куда теперь едешь? — А строение? — спросил зять. — А вот же поймал, нарочно поймал! — отвечал на все руки. В ту же минуту свой стакан в тарелку. В непродолжительном времени была принесена на стол.', 'published', 0, 0, NULL, NULL),
(98, 15, 4, 'То и другое слово, да — и трясутся за каждую копейку. Этот, братец, и в просвещенной России есть теперь весьма много почтенных людей, которые числятся теперь — пристроил. Ей место вон где! — Как.', 'published', 0, 0, NULL, NULL),
(105, 26, 20, '**укыайууцауца**', 'published', 1, 0, NULL, NULL),
(112, 33, 21, 'тесттесттест', 'published', 0, 1, 'Спам', '2026-04-13 09:26:22'),
(113, 34, 20, '124124124125125', 'published', 0, 0, NULL, NULL),
(114, 35, 20, 'sagagsasfasfasf', 'published', 0, 0, NULL, NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `post_deletion_marks`
--

CREATE TABLE `post_deletion_marks` (
  `id` bigint(20) NOT NULL,
  `post_id` bigint(20) NOT NULL,
  `marked_by` bigint(20) NOT NULL,
  `reason` varchar(255) NOT NULL,
  `hidden` tinyint(1) DEFAULT '0',
  `scheduled_delete_at` timestamp NULL DEFAULT NULL,
  `marked_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `post_files`
--

CREATE TABLE `post_files` (
  `id` bigint(20) NOT NULL,
  `post_id` bigint(20) DEFAULT NULL,
  `file_url` varchar(255) DEFAULT NULL,
  `file_type` varchar(50) DEFAULT NULL,
  `uploaded_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `post_history`
--

CREATE TABLE `post_history` (
  `id` bigint(20) NOT NULL,
  `post_id` bigint(20) DEFAULT NULL,
  `editor_id` bigint(20) DEFAULT NULL,
  `content` text,
  `edited_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `roles`
--

CREATE TABLE `roles` (
  `id` bigint(20) NOT NULL,
  `name` varchar(50) NOT NULL,
  `description` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `roles`
--

INSERT INTO `roles` (`id`, `name`, `description`) VALUES
(1, 'user', 'Standard forum user'),
(2, 'moderator', 'Forum moderator'),
(3, 'admin', 'Administrator');

-- --------------------------------------------------------

--
-- Структура таблицы `search_history`
--

CREATE TABLE `search_history` (
  `id` bigint(20) NOT NULL,
  `user_id` bigint(20) NOT NULL,
  `query` varchar(255) NOT NULL,
  `search_date` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `search_history`
--

INSERT INTO `search_history` (`id`, `user_id`, `query`) VALUES
(1, 21, 'wqe'),
(2, 21, 'wqe'),
(3, 21, 'wqe'),
(4, 21, 'wqe');

-- --------------------------------------------------------

--
-- Структура таблицы `search_index`
--

CREATE TABLE `search_index` (
  `id` bigint(20) NOT NULL,
  `entity_type` enum('user','topic','post') DEFAULT NULL,
  `entity_id` bigint(20) DEFAULT NULL,
  `content` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `sessions`
--

CREATE TABLE `sessions` (
  `id` bigint(20) NOT NULL,
  `user_id` bigint(20) DEFAULT NULL,
  `token` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `expires_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `sessions`
--

INSERT INTO `sessions` (`id`, `user_id`, `token`, `expires_at`) VALUES
(1, 11, 'c41547a3f289093861b237e91c3e38da9d2b7e7b3a4819273e72effdd7735fd1', '2026-03-31 19:47:12'),
(2, 11, 'af0fe7097afa32dbddc68a3c39859adf0a20f987e876fd0254b03ecc6b96f3f9', '2026-03-31 20:20:41'),
(3, 11, 'c732b9994cd5150ffed71e5c5ad8631f17a0ab953f9ab1cafcbbb931eb4b2196', '2026-03-31 20:21:17'),
(4, 11, '32b880ca62e82ab8761fa498041568fc8e1f842d268f58172d26bd399372c06a', '2026-03-31 20:21:24'),
(5, 11, 'ec105cec6480b0c9eb9d608eff9e1d8d56edafa1b404af1ddbc1ca1527aa8bb0', '2026-03-31 20:32:08'),
(6, 11, 'cc9fb057ca1654d692598f171811d6f7e39c630b7b7275e838fd9bb0b0c0f377', '2026-03-31 20:34:34'),
(7, 11, '908de6535fc5236e660fdb4b7a43a3eaf6b17d6d2a903e6a62ca221ba76cf5b6', '2026-03-31 20:36:41'),
(8, 11, 'a3ccfdb29897518f9679f28762c21f53f3e825a80449b30a1c288f0138053dec', '2026-03-31 20:41:22'),
(9, 11, '55072dc5660d6950e205a61977da4b9ba669e3524a121a101fb314bcc70f1808', '2026-04-01 07:21:46'),
(10, 11, '90fe9701522834439d2fe333599727e60a34f0feb1f32a9ff1956e037220d3b7', '2026-04-01 07:25:27'),
(11, 11, '86dd98c06e2b48b4c7a5c25fbe8e609fea47c9d7c52f10903f438634089a268b', '2026-04-01 07:26:33'),
(12, 11, '21fea8ff22ddee6471dc491bb7c6204860e8d0093f9ba399123247009b927aea', '2026-04-01 07:27:38'),
(13, 11, '7af37c94d7bbc06e12be9caaad7e38978a3a1cbc044d1986080e1fbf3a0d4597', '2026-04-01 07:27:47'),
(14, 11, 'cc801385ff38d2933c2ab74a1047f5b60780900a8a803cbb05e83891af076f42', '2026-04-01 07:38:52'),
(15, 11, '10e2458fa5d84f90e6b09f25eeab34a1b8951a5ffc21c77e398d1a122d3b4407', '2026-04-01 07:46:22'),
(16, 11, 'd8fbf028ce1762515a33741746aa7c5f7e9c0cb4ee677f05c761ded90429dee9', '2026-04-01 07:47:31'),
(17, 11, 'cab480622211b81ebd02fc2c084004a52b21e46c95285bbe35f50330d95e298c', '2026-04-01 07:47:37'),
(18, 11, 'da37c130570c8e115e15662c228455a1e24f6214d4b570fce94bdf8752112f13', '2026-04-01 07:47:46'),
(19, 11, 'ce45b8e3ee63c9e5655f502b7d926922f0bcf462b617aaa2eb73ccc21b567974', '2026-04-01 07:59:32'),
(20, 11, 'b02387454aaba0dd936859a8b729dc3684a545599597859a0420085b5fc7685e', '2026-04-01 08:02:02'),
(21, 11, '8d17a5c682cd3631360156b799c143f7e6b0b1dd00c5628d9c61fc4212161e78', '2026-04-01 08:04:32'),
(22, 11, '280180330dabf373a79e7875deeff38cac9c0f59955c569b0696eeaa40f983c0', '2026-04-01 08:04:48'),
(23, 11, 'e4a1004a7da321986748a6d5ef7676af5071e4b6a160bf5b0611b0c456d3be02', '2026-04-01 08:06:05'),
(24, 11, '85415c942d54a93b086aa84786fd114e3c5cde45012cf4fed540060054d5e7b3', '2026-04-01 08:06:07'),
(25, 13, '38660e004ff1b411431995db5b1a867e660b1a480aef52f8666ca3db4c2ad337', '2026-04-01 08:09:23'),
(26, 11, 'e962cdf8daf230a0d5f4d36a6d0ede46f64f69bc4fcd10ae3230ab4baa31da72', '2026-04-01 08:10:02'),
(27, 11, '50998ba898a1d19ec95f34b88d15d14eeba0fb2ee556716ab8a6a0e7beeada55', '2026-04-01 08:21:41'),
(28, 13, '447c5a647d5e1ce2266507fc0c77301b2145219089b767be59d87e14832f7633', '2026-04-01 09:28:26'),
(31, 11, 'c8ec8e00f6a526808d17d7b0521a61f0643f39e52138dbcfbef6c53271c3962a', '2026-03-31 09:16:43'),
(32, 11, '32c6fd2b2fb45d5f0e67d1cc728979600304ca25c12537f88abb65937c02739e', '2026-03-31 09:34:13'),
(37, 11, 'a50e009732b650216d95d65df203043dfe6b30942788081d7834023180ae3ce6', '2026-03-31 10:18:23'),
(41, 11, 'ce9b9792bf32f0490a2c70c85ae455c9cb16779c73ddf1bea204f531156f46e9', '2026-03-31 11:10:30'),
(45, 20, '0da8157673aec9c7b23e036bab6d7baed3afac553f50cd85b310079ac4329634', '2026-04-06 21:41:01'),
(46, 20, '8ff836d9ffc63570257d4e3b5d6cc1182b60ff4cfb1c7cd083eb0df700303a6e', '2026-04-06 21:47:44'),
(56, 20, 'd919a21f89efbeacbd87ac42605d87f308b095e46089f08447dc62c9b567878e', '2026-04-07 03:11:28'),
(77, 20, '4aa745f93ad1d15e82c9facf490120e7fb5ead6ea307df519f4e6817b3561a6c', '2026-04-14 07:27:52'),
(91, 23, 'afdc4d79c4da2429456202b0350ea57a96ab3baf21252bae7af4e58d1cde5227', '2026-04-28 03:31:07'),
(92, 20, '1ee00b7c5dd37fca835df130ced14407ab9908b8393bff0fe0deca296ab1efb9', '2026-04-30 04:57:10'),
(96, 20, 'f1fb197c1c5dce89f5c39a23d346ac59b6fe18b91fdeba1a84539e34bca7927a', '2026-05-01 01:53:48'),
(105, 21, 'c336a3060888832df0bdc7869af2544072cfb4bcd17ea6d6419493466827b95e', '2026-05-08 13:32:50');

-- --------------------------------------------------------

--
-- Структура таблицы `tags`
--

CREATE TABLE `tags` (
  `id` bigint(20) NOT NULL,
  `name` varchar(50) NOT NULL,
  `type` enum('topic','post','user') DEFAULT 'topic'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `tags`
--

INSERT INTO `tags` (`id`, `name`, `type`) VALUES
(1, 'php', 'topic');

-- --------------------------------------------------------

--
-- Структура таблицы `topics`
--

CREATE TABLE `topics` (
  `id` bigint(20) NOT NULL,
  `title` varchar(255) NOT NULL,
  `description` text,
  `author_id` bigint(20) DEFAULT NULL,
  `category_id` bigint(20) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `status` enum('open','closed','archived','draft') DEFAULT 'open',
  `is_pinned` tinyint(1) DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `topics`
--

INSERT INTO `topics` (`id`, `title`, `description`, `author_id`, `category_id`, `status`, `is_pinned`) VALUES
(7, 'Eos architecto est quia quia.', NULL, 1, NULL, 'open', 0),
(8, 'Ea et quia nihil laborum quis sequi modi.', NULL, 1, NULL, 'open', 0),
(9, 'Nihil tempora itaque quibusdam aut.', NULL, 1, NULL, 'open', 0),
(10, 'Autem natus facere sit tenetur id repellat.', NULL, 1, NULL, 'open', 0),
(11, 'In eveniet accusantium ut iste hic illo.', NULL, 2, NULL, 'open', 0),
(12, 'Saepe dolores minus quos.', NULL, 8, NULL, 'open', 0),
(13, 'Esse ratione sapiente perferendis et.', NULL, 5, NULL, 'open', 0),
(14, 'Nemo aut officia et soluta corrupti.', NULL, 6, NULL, 'open', 0),
(15, 'Aliquam sed enim ut quibusdam nihil.', NULL, 3, NULL, 'open', 0),
(16, 'Laboriosam quod quis blanditiis tempore quo quia.', NULL, 7, NULL, 'open', 0),
(17, 'Et enim tenetur blanditiis nobis sint.', NULL, 2, NULL, 'open', 0),
(18, 'Dolore neque commodi fugit atque deserunt et.', NULL, 6, NULL, 'open', 0),
(19, 'Voluptas quibusdam sunt omnis facere.', NULL, 1, NULL, 'open', 0),
(20, 'Quas natus quae est excepturi ut quod sed.', NULL, 6, NULL, 'open', 0),
(26, 'Регистрация со спец-символами в поле Имя', '**укыайууцауца**', 20, NULL, NULL, 0),
(33, 'тест', 'тесттесттест', 21, NULL, NULL, 0),
(34, '1231243', '124124124125125', 20, NULL, 'open', 0),
(35, 'Eos asffg', 'sagagsasfasfasf', 20, 1, 'open', 0);

-- --------------------------------------------------------

--
-- Структура таблицы `topic_tags`
--

CREATE TABLE `topic_tags` (
  `topic_id` bigint(20) NOT NULL,
  `tag_id` bigint(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `topic_tags`
--

INSERT INTO `topic_tags` (`topic_id`, `tag_id`) VALUES
(34, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` bigint(20) NOT NULL,
  `username` varchar(50) NOT NULL,
  `avatar_url` varchar(500) DEFAULT NULL,
  `user_role` enum('user','moderator','admin') DEFAULT 'user',
  `email` varchar(100) DEFAULT NULL,
  `password_hash` varchar(255) NOT NULL,
  `status` enum('active','blocked') DEFAULT 'active',
  `failed_attempts` int(11) DEFAULT '0',
  `locked_until` datetime DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `last_failed_at` datetime DEFAULT NULL,
  `two_factor_secret` varchar(64) DEFAULT NULL,
  `two_factor_enabled` tinyint(1) NOT NULL DEFAULT '0',
  `email_confirmed` tinyint(1) NOT NULL DEFAULT '0',
  `ban_until` datetime DEFAULT NULL,
  `ban_reason` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `username`, `avatar_url`, `user_role`, `email`, `password_hash`, `status`, `failed_attempts`, `locked_until`, `last_failed_at`, `two_factor_secret`, `two_factor_enabled`, `email_confirmed`, `ban_until`, `ban_reason`) VALUES
(1, 'wknyzeva', NULL, 'admin', 'abramova.dary@example.com', '$2y$10$06mVxDshrHTcnWVAiKhGquQKsMdBnAtY9DH0ASZtUkiANrajgC.82', 'active', 0, NULL, NULL, NULL, 0, 0, NULL, NULL),
(2, 'gerasimov.yroslava', NULL, 'user', 'polina62@example.com', '$2y$10$/2a/QT9GkHLbR2DY3w9svufuQ9itjWgV8lUIR7A2ZAs5M4oVucwcC', 'active', 0, NULL, NULL, NULL, 0, 0, NULL, NULL),
(3, 'lidiy56', NULL, 'user', 'davydov.rozalina@example.net', '$2y$10$UlDG2eKXaFwTdunjJijP1ePwj9vxsCbKDlXAi1Ru7cPzarpv1e/7m', 'active', 0, NULL, NULL, NULL, 0, 0, NULL, NULL),
(4, 'malvina65', NULL, 'user', 'hbragin@example.org', '$2y$10$ZjBrY88fdegTZhiVGvdAwuGJ82k/MAjCNTFtPjQpxdJbCvCTnWgei', 'active', 0, NULL, NULL, NULL, 0, 0, NULL, NULL),
(5, 'zlata.orlov', NULL, 'user', 'mgureva@example.com', '$2y$10$Au.bCH8pvYOVZ2J73jKwJ.a3QlHEFNQC50tUyg9w6Wjny4GxDy.ZG', 'active', 0, NULL, NULL, NULL, 0, 0, NULL, NULL),
(6, 'ksoloveva', NULL, 'user', 'filatov.ignatii@example.net', '$2y$10$msMM55HDQiYe4QQ4VRImWekFr8X2tBTQAeuCpCxWP4c4WYKOVd4Qe', 'active', 0, NULL, NULL, NULL, 0, 0, NULL, NULL),
(7, 'izabella.subbotina', NULL, 'user', 'grigorii78@example.org', '$2y$10$wDb.QpB6Ly0.e//dGLIagesW8QkTqi/v5o5JQd1vgemrRpJj1edGK', 'active', 0, NULL, NULL, NULL, 0, 0, NULL, NULL),
(8, 'vera.vasileva', NULL, 'user', 'tnekrasova@example.org', '$2y$10$m70fdd02oJcJF9pqr5044OtxlZWr6lcQ5Q9wS004OIn6uaupXGitK', 'active', 0, NULL, NULL, NULL, 0, 0, NULL, NULL),
(9, 'vadim.eliseev', NULL, 'user', 'wzimin@example.net', '$2y$10$ps90Hv0VTFWx4FFhsYwkG.D7bMcOLkGhpvlDnXWvB8xNOO22/n1Qa', 'active', 0, NULL, NULL, NULL, 0, 0, NULL, NULL),
(10, 'lysy22', NULL, 'user', 'vikentii.nikiforov@example.net', '$2y$10$IpKkQHsWIOyw2xVJNwZ0MODCgpztG9UwfHzdb82oNs/HrZWxh/lgG', 'active', 0, NULL, NULL, NULL, 0, 0, NULL, NULL),
(11, 'Raymet', NULL, 'user', 'rede@gmail.com', '$2y$10$SDLh3rseqt6LAnzCQt1vA.Zii4raJTywldipW1muYqBhv5/T7MoVq', 'active', 0, NULL, NULL, NULL, 0, 0, NULL, NULL),
(12, 'Rimet', NULL, 'user', 'Rimet@gmail.com', '$2y$10$NWHzTj00ZuQ0sKM5qGyfyu/Rqn8iG8SK2WghslOthhDvkA8VEz2oa', 'active', 0, NULL, NULL, NULL, 0, 0, NULL, NULL),
(13, 'КАМЫШ', NULL, 'user', 'rede1@gmail.com', '$2y$10$K3bGgmTFseDv510qGZllq.KzqceSUMB7xNAuBjk4BQhUZhClZ52yi', 'active', 0, NULL, NULL, NULL, 0, 0, NULL, NULL),
(14, '123', NULL, 'user', 'doctorimet@gmail.com', '$argon2id$v=19$m=65536,t=4,p=1$NzNrTlZRQkFHSnNRcE5SNQ$MVLoSgC9cuyZOAaqDBmlWSA/6gYinUUVpZ/wt2MvWhc', 'active', 0, NULL, NULL, NULL, 0, 0, NULL, NULL),
(15, 'risword', NULL, 'user', 'Ris@gmail.com', '$argon2id$v=19$m=65536,t=4,p=1$UGtPbXkucnJ4NWVxSkRscg$LnynweDzHO/p2DeDR7+W0LANTdbAgxchhHI7uVGc4tM', 'active', 0, NULL, NULL, NULL, 0, 0, NULL, NULL),
(16, 'riswo', NULL, 'user', 'Riss@gmail.com', '$argon2id$v=19$m=65536,t=4,p=1$cEpRYkxLUVNERHgzMWxabw$dn8aVD3slolPRgurmgNGFzxu1wn8SsiqlRx3SLakMW4', 'active', 0, NULL, NULL, NULL, 0, 0, NULL, NULL),
(17, 'riswo1', NULL, 'user', 'Riss1@gmail.com', '$argon2id$v=19$m=65536,t=4,p=1$dndaN3JXRlBJYVlsWVJ3eA$3fSwf92BmFbDAi7fNz21a/iKLVTtPRwwTDEB2gN+V+o', 'active', 0, NULL, NULL, NULL, 0, 0, NULL, NULL),
(18, 'Rimet1', NULL, 'user', 'Rimet1@gmail.com', '$argon2id$v=19$m=65536,t=4,p=1$Y0NPQVJWeE5QRERYUUZXbQ$W2NpX11IOZXha/a0dEPkNZsODm2aKjiFW6fj0/YFLJo', 'blocked', 0, NULL, NULL, NULL, 0, 1, NULL, NULL),
(19, 'Rimet11', NULL, 'user', 'Rimet11@gmail.com', '$argon2id$v=19$m=65536,t=4,p=1$VFNPRFJlYWVueW9xY05sWg$J2/8TNeHMWviCSpIRWOsu7z2+E/MJ0kFtEKiJxqhH4c', 'active', 0, NULL, NULL, NULL, 0, 1, '2026-05-04 06:24:16', NULL),
(20, 'ридиска', 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS0THJ7GJDxT2uwFWjLMTz_KZHwCDIngXrjWg&s', 'admin', 'ridis@gmail.com', '$argon2id$v=19$m=65536,t=4,p=1$RmNoLjNyaTFodncvNFo5Zw$roNOKVHhpDkfYZ6YXtCAJ2fRDXiwjlHQ9PnmCgY07/U', 'active', 0, NULL, NULL, NULL, 0, 1, NULL, NULL),
(21, 'тест', 'http://forumchat/home/profile.php', 'user', 'test@gmail.com', '$argon2id$v=19$m=65536,t=4,p=1$NjJLNzY5di5ZanpnWVY3OA$vpmdNpfz2NMhcsh++bn7DCiZiuGvsCGsg5qDXAYIfPk', 'active', 0, NULL, NULL, NULL, 0, 1, '2026-04-27 07:25:02', NULL),
(22, 'test2', NULL, 'user', 'test2@gmail.com', '$argon2id$v=19$m=65536,t=4,p=1$TlJmQkp3RUZLM1o3aUUvRg$fA12xgKZGOrIU5CsQJdWySY8cesTQQRuKl8FlEW19Z0', 'active', 0, NULL, NULL, NULL, 0, 1, '2026-04-27 07:24:36', NULL),
(23, 'киРА', NULL, 'moderator', '1221233@gmail.com', '$argon2id$v=19$m=65536,t=4,p=1$a1JQaThNVVBvdmdmZjhvVg$F6DGB7PgZN0OdzoFbrlsbcqMYM8UcpTs54ywRPgCMEM', 'active', 1, NULL, '2026-04-29 09:56:26', NULL, 0, 1, '2026-05-04 08:29:54', ''),
(24, 'TestAsign', NULL, 'user', 'TestAsign@gmail.com', '$argon2id$v=19$m=65536,t=4,p=1$by5jYzFWVzk4TGFRT2RFaQ$D6+0Yv4DZVp+D2crPDookHTUdsJxybJsSxOv99mgfiw', 'active', 0, NULL, NULL, NULL, 0, 1, NULL, NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `user_lists`
--

CREATE TABLE `user_lists` (
  `id` bigint(20) NOT NULL,
  `user_id` bigint(20) DEFAULT NULL,
  `name` varchar(100) DEFAULT NULL,
  `type` enum('saved','in_progress','completed') DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `user_profiles`
--

CREATE TABLE `user_profiles` (
  `user_id` bigint(20) NOT NULL,
  `first_name` varchar(50) DEFAULT NULL,
  `last_name` varchar(50) DEFAULT NULL,
  `avatar_url` varchar(255) DEFAULT NULL,
  `bio` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `user_profiles`
--

INSERT INTO `user_profiles` (`user_id`, `first_name`, `last_name`, `avatar_url`, `bio`) VALUES
(11, NULL, NULL, 'https://avatars.mds.yandex.net/i?id=e5e5e817930bf7f2f3d40b0ff051659e_l-5219773-images-thumbs&n=13', NULL),
(20, NULL, NULL, 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS0THJ7GJDxT2uwFWjLMTz_KZHwCDIngXrjWg&s', NULL),
(21, NULL, NULL, 'http://forumchat/home/profile.php', NULL),
(23, NULL, NULL, NULL, NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `user_roles`
--

CREATE TABLE `user_roles` (
  `user_id` bigint(20) NOT NULL,
  `role_id` bigint(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `user_roles`
--

INSERT INTO `user_roles` (`user_id`, `role_id`) VALUES
(14, 1),
(15, 1),
(16, 1),
(17, 1),
(21, 1),
(22, 1),
(24, 1),
(23, 2),
(11, 3),
(18, 3),
(19, 3),
(20, 3);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `admin_actions`
--
ALTER TABLE `admin_actions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `admin_id` (`admin_id`),
  ADD KEY `created_at` (`created_at`);

--
-- Индексы таблицы `attachments`
--
ALTER TABLE `attachments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `post_id` (`post_id`),
  ADD KEY `comment_id` (`comment_id`),
  ADD KEY `topic_id` (`topic_id`);

--
-- Индексы таблицы `blocked_users`
--
ALTER TABLE `blocked_users`
  ADD PRIMARY KEY (`user_id`),
  ADD KEY `blocked_by` (`blocked_by`);

--
-- Индексы таблицы `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`),
  ADD KEY `parent_id` (`parent_id`);

--
-- Индексы таблицы `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `post_id` (`post_id`),
  ADD KEY `author_id` (`author_id`);

--
-- Индексы таблицы `complaints`
--
ALTER TABLE `complaints`
  ADD PRIMARY KEY (`id`),
  ADD KEY `post_id` (`post_id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `drafts`
--
ALTER TABLE `drafts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `post_id` (`post_id`),
  ADD KEY `author_id` (`author_id`);

--
-- Индексы таблицы `email_confirmations`
--
ALTER TABLE `email_confirmations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `filters`
--
ALTER TABLE `filters`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `forbidden_words`
--
ALTER TABLE `forbidden_words`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `word` (`word`),
  ADD KEY `created_by` (`created_by`);

--
-- Индексы таблицы `managed_topics`
--
ALTER TABLE `managed_topics`
  ADD PRIMARY KEY (`topic_id`);

--
-- Индексы таблицы `moderation_log`
--
ALTER TABLE `moderation_log`
  ADD PRIMARY KEY (`id`),
  ADD KEY `moderator_id` (`moderator_id`),
  ADD KEY `idx_moderation_log_created_at` (`created_at`);

--
-- Индексы таблицы `moderation_logs`
--
ALTER TABLE `moderation_logs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `moderator_id` (`moderator_id`);

--
-- Индексы таблицы `navigation_sections`
--
ALTER TABLE `navigation_sections`
  ADD PRIMARY KEY (`id`),
  ADD KEY `parent_id` (`parent_id`);

--
-- Индексы таблицы `notifications`
--
ALTER TABLE `notifications`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `password_resets`
--
ALTER TABLE `password_resets`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `token` (`token`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `posts`
--
ALTER TABLE `posts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `topic_id` (`topic_id`),
  ADD KEY `author_id` (`author_id`),
  ADD KEY `idx_posts_hidden` (`hidden`),
  ADD KEY `idx_posts_deleted` (`deleted`);

--
-- Индексы таблицы `post_deletion_marks`
--
ALTER TABLE `post_deletion_marks`
  ADD PRIMARY KEY (`id`),
  ADD KEY `post_id` (`post_id`),
  ADD KEY `marked_by` (`marked_by`),
  ADD KEY `scheduled_delete_at` (`scheduled_delete_at`),
  ADD KEY `idx_deletion_marks_status` (`marked_at`,`deleted_at`);

--
-- Индексы таблицы `post_files`
--
ALTER TABLE `post_files`
  ADD PRIMARY KEY (`id`),
  ADD KEY `post_id` (`post_id`);

--
-- Индексы таблицы `post_history`
--
ALTER TABLE `post_history`
  ADD PRIMARY KEY (`id`),
  ADD KEY `post_id` (`post_id`),
  ADD KEY `editor_id` (`editor_id`);

--
-- Индексы таблицы `roles`
--
ALTER TABLE `roles`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Индексы таблицы `search_history`
--
ALTER TABLE `search_history`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_user_date` (`user_id`,`DESC`),
  ADD KEY `idx_search_date` (`search_date`);

--
-- Индексы таблицы `search_index`
--
ALTER TABLE `search_index`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_search_content` (`content`(255));

--
-- Индексы таблицы `sessions`
--
ALTER TABLE `sessions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `tags`
--
ALTER TABLE `tags`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Индексы таблицы `topics`
--
ALTER TABLE `topics`
  ADD PRIMARY KEY (`id`),
  ADD KEY `author_id` (`author_id`);

--
-- Индексы таблицы `topic_tags`
--
ALTER TABLE `topic_tags`
  ADD PRIMARY KEY (`topic_id`,`tag_id`),
  ADD KEY `idx_tag_id` (`tag_id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD UNIQUE KEY `email` (`email`);

--
-- Индексы таблицы `user_lists`
--
ALTER TABLE `user_lists`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_id` (`user_id`);

--
-- Индексы таблицы `user_profiles`
--
ALTER TABLE `user_profiles`
  ADD PRIMARY KEY (`user_id`);

--
-- Индексы таблицы `user_roles`
--
ALTER TABLE `user_roles`
  ADD PRIMARY KEY (`user_id`,`role_id`),
  ADD KEY `role_id` (`role_id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `admin_actions`
--
ALTER TABLE `admin_actions`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT для таблицы `attachments`
--
ALTER TABLE `attachments`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT для таблицы `categories`
--
ALTER TABLE `categories`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `comments`
--
ALTER TABLE `comments`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=33;

--
-- AUTO_INCREMENT для таблицы `complaints`
--
ALTER TABLE `complaints`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `drafts`
--
ALTER TABLE `drafts`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `email_confirmations`
--
ALTER TABLE `email_confirmations`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT для таблицы `filters`
--
ALTER TABLE `filters`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `forbidden_words`
--
ALTER TABLE `forbidden_words`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=45;

--
-- AUTO_INCREMENT для таблицы `moderation_log`
--
ALTER TABLE `moderation_log`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `moderation_logs`
--
ALTER TABLE `moderation_logs`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `navigation_sections`
--
ALTER TABLE `navigation_sections`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `notifications`
--
ALTER TABLE `notifications`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT для таблицы `password_resets`
--
ALTER TABLE `password_resets`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT для таблицы `posts`
--
ALTER TABLE `posts`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=115;

--
-- AUTO_INCREMENT для таблицы `post_deletion_marks`
--
ALTER TABLE `post_deletion_marks`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `post_files`
--
ALTER TABLE `post_files`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `post_history`
--
ALTER TABLE `post_history`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `roles`
--
ALTER TABLE `roles`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `search_history`
--
ALTER TABLE `search_history`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT для таблицы `search_index`
--
ALTER TABLE `search_index`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `sessions`
--
ALTER TABLE `sessions`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=106;

--
-- AUTO_INCREMENT для таблицы `tags`
--
ALTER TABLE `tags`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `topics`
--
ALTER TABLE `topics`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- AUTO_INCREMENT для таблицы `user_lists`
--
ALTER TABLE `user_lists`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `admin_actions`
--
ALTER TABLE `admin_actions`
  ADD CONSTRAINT `admin_actions_ibfk_1` FOREIGN KEY (`admin_id`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `attachments`
--
ALTER TABLE `attachments`
  ADD CONSTRAINT `attachments_ibfk_1` FOREIGN KEY (`post_id`) REFERENCES `posts` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `attachments_ibfk_2` FOREIGN KEY (`comment_id`) REFERENCES `comments` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `attachments_ibfk_3` FOREIGN KEY (`topic_id`) REFERENCES `topics` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `blocked_users`
--
ALTER TABLE `blocked_users`
  ADD CONSTRAINT `blocked_users_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`),
  ADD CONSTRAINT `blocked_users_ibfk_2` FOREIGN KEY (`blocked_by`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `categories`
--
ALTER TABLE `categories`
  ADD CONSTRAINT `categories_ibfk_1` FOREIGN KEY (`parent_id`) REFERENCES `categories` (`id`);

--
-- Ограничения внешнего ключа таблицы `comments`
--
ALTER TABLE `comments`
  ADD CONSTRAINT `comments_ibfk_1` FOREIGN KEY (`post_id`) REFERENCES `posts` (`id`),
  ADD CONSTRAINT `comments_ibfk_2` FOREIGN KEY (`author_id`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `complaints`
--
ALTER TABLE `complaints`
  ADD CONSTRAINT `complaints_ibfk_1` FOREIGN KEY (`post_id`) REFERENCES `posts` (`id`),
  ADD CONSTRAINT `complaints_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `drafts`
--
ALTER TABLE `drafts`
  ADD CONSTRAINT `drafts_ibfk_1` FOREIGN KEY (`post_id`) REFERENCES `posts` (`id`),
  ADD CONSTRAINT `drafts_ibfk_2` FOREIGN KEY (`author_id`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `filters`
--
ALTER TABLE `filters`
  ADD CONSTRAINT `filters_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `forbidden_words`
--
ALTER TABLE `forbidden_words`
  ADD CONSTRAINT `forbidden_words_ibfk_1` FOREIGN KEY (`created_by`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `managed_topics`
--
ALTER TABLE `managed_topics`
  ADD CONSTRAINT `managed_topics_ibfk_1` FOREIGN KEY (`topic_id`) REFERENCES `topics` (`id`);

--
-- Ограничения внешнего ключа таблицы `moderation_log`
--
ALTER TABLE `moderation_log`
  ADD CONSTRAINT `moderation_log_ibfk_1` FOREIGN KEY (`moderator_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `moderation_logs`
--
ALTER TABLE `moderation_logs`
  ADD CONSTRAINT `moderation_logs_ibfk_1` FOREIGN KEY (`moderator_id`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `navigation_sections`
--
ALTER TABLE `navigation_sections`
  ADD CONSTRAINT `navigation_sections_ibfk_1` FOREIGN KEY (`parent_id`) REFERENCES `navigation_sections` (`id`);

--
-- Ограничения внешнего ключа таблицы `notifications`
--
ALTER TABLE `notifications`
  ADD CONSTRAINT `notifications_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `password_resets`
--
ALTER TABLE `password_resets`
  ADD CONSTRAINT `password_resets_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `posts`
--
ALTER TABLE `posts`
  ADD CONSTRAINT `posts_ibfk_1` FOREIGN KEY (`topic_id`) REFERENCES `topics` (`id`),
  ADD CONSTRAINT `posts_ibfk_2` FOREIGN KEY (`author_id`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `post_deletion_marks`
--
ALTER TABLE `post_deletion_marks`
  ADD CONSTRAINT `post_deletion_marks_ibfk_1` FOREIGN KEY (`post_id`) REFERENCES `posts` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `post_deletion_marks_ibfk_2` FOREIGN KEY (`marked_by`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `post_files`
--
ALTER TABLE `post_files`
  ADD CONSTRAINT `post_files_ibfk_1` FOREIGN KEY (`post_id`) REFERENCES `posts` (`id`);

--
-- Ограничения внешнего ключа таблицы `post_history`
--
ALTER TABLE `post_history`
  ADD CONSTRAINT `post_history_ibfk_1` FOREIGN KEY (`post_id`) REFERENCES `posts` (`id`),
  ADD CONSTRAINT `post_history_ibfk_2` FOREIGN KEY (`editor_id`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `search_history`
--
ALTER TABLE `search_history`
  ADD CONSTRAINT `search_history_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `sessions`
--
ALTER TABLE `sessions`
  ADD CONSTRAINT `sessions_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `topics`
--
ALTER TABLE `topics`
  ADD CONSTRAINT `topics_ibfk_1` FOREIGN KEY (`author_id`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `topic_tags`
--
ALTER TABLE `topic_tags`
  ADD CONSTRAINT `fk_topic_tags_tag` FOREIGN KEY (`tag_id`) REFERENCES `tags` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `fk_topic_tags_topic` FOREIGN KEY (`topic_id`) REFERENCES `topics` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `user_lists`
--
ALTER TABLE `user_lists`
  ADD CONSTRAINT `user_lists_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `user_profiles`
--
ALTER TABLE `user_profiles`
  ADD CONSTRAINT `user_profiles_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `user_roles`
--
ALTER TABLE `user_roles`
  ADD CONSTRAINT `user_roles_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`),
  ADD CONSTRAINT `user_roles_ibfk_2` FOREIGN KEY (`role_id`) REFERENCES `roles` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
